Revit 2024 API
ElectricalLoadAreaData.GetAreaBasedLoadIds Method
 Gets the area based load ids of the electrical load area to be included.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetAreaBasedLoadIds()
Visual Basic
Public Function GetAreaBasedLoadIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetAreaBasedLoadIds()
See Also
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace